package aaray2d;

public class Test01 {
	public static void main(String[] args) {
		
		//1차원일때
		int[] a = new int[90];

		//2차원일때
		int[][] b = new int[18][5];

		//3차원일때
		int[][][] c = new int[3][6][5];
		
		//4차원일때
			}

}
//목표 : 차원 이해하기
//- 차원은 데이터를 바라보는 관점!
//ex : 학생 90명이 있다고 할 때 ...
//- 0차원 : 데이터 90개(학생 90명) - 변수 90개 (학생)
//- 1차원 : 1차원배열 18개(5명씩 18반) - 배열 18개 (반)
//- 2차원 : 2차원배열 6개(6반씩 3개 학년) - 배열 3개 (학년)
//- 3차원 : (Ex) 학교 단위
//- 4차원 : (ex) 학군 단위
//- 5차원 : (ex) 국가 단위 